Hello @melinath, I could fix the above error, but I faced another error like below. I'm not sure why only contents_delta_uri was not stored in the terraform state. I'd appreciate it if I could get some advice on that if you've seen a similar error before. Thank you.


```
2022-10-21T20:00:55.405-0700 [ERROR] sdk.helper_resource: Unexpected error: test_name=TestAccVertexAIIndex_vertexAiIndexExample test_step_number=1 test_terraform_path=/opt/homebrew/bin/terraform test_working_directory=/var/folders/kd/2mm1sqn16s96zq819f1504r80000gp/T/plugintest3149284593
  error=
  | After applying this test step, the plan was not empty.
  | stdout:
  |
  |
  | Terraform used the selected providers to generate the following execution
  | plan. Resource actions are indicated with the following symbols:
  | -/+ destroy and then create replacement
  |
  | Terraform will perform the following actions:
  |
  |   # google_vertex_ai_index.index must be replaced
  | -/+ resource "google_vertex_ai_index" "index" {
  |       ~ create_time         = "2022-10-22T02:22:21.037842Z" -> (known after apply)
  |       ~ deployed_indexes    = [] -> (known after apply)
  |       ~ etag                = "AMEw9yPzsv8NH0FArDXXpRqdJAZHhUuWGXuz81l_3_7q1BDfKh0lLHoQS45HmiwKoknu" -> (known after apply)
  |       ~ id                  = "projects/kouzoh-p-kohama/locations/us-central1/indexes/1063676344803524608" -> (known after apply)
  |       ~ metadata_schema_uri = "gs://google-cloud-aiplatform/schema/matchingengine/metadata/nearest_neighbor_search_1.0.0.yaml" -> (known after apply)
  |       ~ name                = "1063676344803524608" -> (known after apply)
  |       ~ project             = "kouzoh-p-kohama" -> (known after apply)
  |       ~ update_time         = "2022-10-22T03:00:45.812169Z" -> (known after apply)
  |         # (4 unchanged attributes hidden)
  |
  |       ~ metadata {
  |           + contents_delta_uri    = "gs://kouzoh-p-kohama-tf-test-vertex-ai-index-testfp0bnw3p68/contents" # forces replacement
  |             # (1 unchanged attribute hidden)
  |
  |           ~ config {
  |                 # (4 unchanged attributes hidden)
  |
  |               ~ algorithm_config {
  |                     # (1 unchanged block hidden)
  |                 }
  |             }
  |         }
  |     }
  |
  | Plan: 1 to add, 0 to change, 1 to destroy.

    provider_test.go:307: Step 1/2 error: After applying this test step, the plan was not empty.
```
